---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.TopRailType
source: html/7c8fbc3c-002a-13ce-6dba-89475866b0ce.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.TopRailType Property

The type of the top rail in the railing system.

## Syntax (C#)
```csharp
public ElementId TopRailType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The topRailType is not a valid top rail type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null